# web - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.random_password.nextauthsecret: Refreshing state... [id=none]
module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.gateway_api_api_gateway_id: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=production]
module.common_resources.aws_cognito_user_pool_client.default: Refreshing state... [id=4b40ic65moeoot7qjmf7arsun3]
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_apis.gateway_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.gateway_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Read complete after 0s [id=lfdgjp94z7]
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Read complete after 0s [id=c87otdqh8g]
module.common_resources.data.aws_apigatewayv2_api.gateway_api_api_gateway: Read complete after 0s [id=l09k6gy1lf]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Read complete after 0s [id=1sv926z3fc]
module.common_resources.vercel_project.default: Refreshing state... [id=prj_BJCb1oYIBA9lcQGSZ9FPrDahWRRN]
module.common_resources.vercel_project_domain.default: Refreshing state... [id=new-production.connectilly.com]
module.common_resources.vercel_deployment.default: Refreshing state... [id=dpl_4UbmPmFiPRiyQyiM96huu7DBibd3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.common_resources.vercel_deployment.default must be replaced
-/+ resource "vercel_deployment" "default" {
      ~ domains     = [ # forces replacement
          - "new-production.connectilly.com",
          - "production-web-nine.vercel.app",
          - "production-web-connectilly.vercel.app",
          - "production-web-mortezaconnectilly-connectilly.vercel.app",
        ] -> (known after apply) # forces replacement
      ~ files       = { # forces replacement
          ~ "../../../infrastructure/workspaces/common_resources/resources.tf"                                = "5339~c37b06862e8be484cb1b8276bb215c673e5ab0bc" -> "5330~d50f48d1eeb1201fdd0073aa902420b0392da25c"
          ~ "../../../package.json"                                                                           = "1373~e9d3b44e2b0ebcedb053784dbb69d0e995a95a3e" -> "1373~a3047023c5dca63cb5fc2a86ab63282a723a752b"
          ~ "../../../src/pages/api/auth/[...nextauth].ts"                                                    = "5305~adc9936676cb9189286ac9e15900d99e7532b080" -> "5650~d9db5b17a13f44b87f3f5850aee07e969761e2be"
          ~ "../../../yarn.lock"                                                                              = "152646~d91c8e536f0a42d0a5aeb997dda7da9784879763" -> "152646~175637a42ac426aeae5c8d9a9ad4f1e89882840b"
            # (91 unchanged elements hidden)
        }
      ~ id          = "dpl_4UbmPmFiPRiyQyiM96huu7DBibd3" -> (known after apply)
      ~ url         = "production-7wgubosx8-connectilly.vercel.app" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.common_resources.vercel_project.default will be updated in-place
  ~ resource "vercel_project" "default" {
      ~ environment                = (sensitive value)
        id                         = "prj_BJCb1oYIBA9lcQGSZ9FPrDahWRRN"
        name                       = "production-web"
      + serverless_function_region = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*